hdscmcu/pyOCD/pyocd/debug/svd/data/HC32F165.svd
<?xml version="1.0" ?>
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
    <vendor>HDSC</vendor>
    <vendorID>HDSC</vendorID>
    <name>HDSC_HC32F165</name>
    <series>ARMCM0P</series>
    <version>1.0</version>
    <cpu>
        <name>CM0P</name>
        <revision>r0p1</revision>
        <endian>little</endian>
        <mpuPresent>true</mpuPresent>
        <fpuPresent>true</fpuPresent>
        <nvicPrioBits>4</nvicPrioBits>
        <vendorSystickConfig>false</vendorSystickConfig>
    </cpu>
    <addressUnitBits>8</addressUnitBits>
    <width>32</width>
    <size>32</size>
    <access>read-write</access>
    <resetValue>0x0</resetValue>
    <resetMask>0x0</resetMask>
    <peripherals>
        <peripheral>
            <name>ADC</name>
            <description>desc ADC</description>
            <baseAddress>0x40030000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0xB2</size>
            </addressBlock>
            <registers>
                <register>
                    <name>STR</name>
                    <description>desc STR</description>
                    <addressOffset>0x0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>STRT</name>
                            <description>desc STRT</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CR0</name>
                    <description>desc CR0</description>
                    <addressOffset>0x2</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7F3</resetMask>
                    <fields>
                        <field>
                            <name>MS</name>
                            <description>desc MS</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ACCSEL</name>
                            <description>desc ACCSEL</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLREN</name>
                            <description>desc CLREN</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DFMT</name>
                            <description>desc DFMT</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AVCNT</name>
                            <description>desc AVCNT</description>
                            <msb>10</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CR1</name>
                    <description>desc CR1</description>
                    <addressOffset>0x4</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xE4</resetMask>
                    <fields>
                        <field>
                            <name>RSCHSEL</name>
                            <description>desc RSCHSEL</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SREFBUFEN</name>
                            <description>desc SREFBUFEN</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SREF</name>
                            <description>desc SREF</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TRGSR</name>
                    <description>desc TRGSR</description>
                    <addressOffset>0xA</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x8383</resetMask>
                    <fields>
                        <field>
                            <name>TRGSELA</name>
                            <description>desc TRGSELA</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRGENA</name>
                            <description>desc TRGENA</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRGSELB</name>
                            <description>desc TRGSELB</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRGENB</name>
                            <description>desc TRGENB</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SSTR0</name>
                    <description>desc SSTR0</description>
                    <addressOffset>0x20</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x4</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTR1</name>
                    <description>desc SSTR1</description>
                    <addressOffset>0x21</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x4</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTR2</name>
                    <description>desc SSTR2</description>
                    <addressOffset>0x22</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x4</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTR3</name>
                    <description>desc SSTR3</description>
                    <addressOffset>0x23</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x4</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTR4</name>
                    <description>desc SSTR4</description>
                    <addressOffset>0x24</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x4</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTR5</name>
                    <description>desc SSTR5</description>
                    <addressOffset>0x25</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x4</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTR6</name>
                    <description>desc SSTR6</description>
                    <addressOffset>0x26</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x4</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTR7</name>
                    <description>desc SSTR7</description>
                    <addressOffset>0x27</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x4</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTR8</name>
                    <description>desc SSTR8</description>
                    <addressOffset>0x28</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x4</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTR9</name>
                    <description>desc SSTR9</description>
                    <addressOffset>0x29</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x4</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTR10</name>
                    <description>desc SSTR10</description>
                    <addressOffset>0x30</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x4</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTR11</name>
                    <description>desc SSTR11</description>
                    <addressOffset>0x31</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x4</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTR12</name>
                    <description>desc SSTR12</description>
                    <addressOffset>0x32</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x4</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTR13</name>
                    <description>desc SSTR13</description>
                    <addressOffset>0x33</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x4</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTR14</name>
                    <description>desc SSTR14</description>
                    <addressOffset>0x34</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x4</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTR15</name>
                    <description>desc SSTR15</description>
                    <addressOffset>0x35</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x4</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTR16</name>
                    <description>desc SSTR16</description>
                    <addressOffset>0x36</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x4</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>SSTR17</name>
                    <description>desc SSTR17</description>
                    <addressOffset>0x37</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x4</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>ISR</name>
                    <description>desc ISR</description>
                    <addressOffset>0x44</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x13</resetMask>
                    <fields>
                        <field>
                            <name>EOCAF</name>
                            <description>desc EOCAF</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EOCBF</name>
                            <description>desc EOCBF</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SASTPDF</name>
                            <description>desc SASTPDF</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICR</name>
                    <description>desc ICR</description>
                    <addressOffset>0x45</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x3</resetValue>
                    <resetMask>0x3</resetMask>
                    <fields>
                        <field>
                            <name>EOCAIEN</name>
                            <description>desc EOCAIEN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EOCBIEN</name>
                            <description>desc EOCBIEN</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ISCLRR</name>
                    <description>desc ISCLRR</description>
                    <addressOffset>0x46</addressOffset>
                    <size>8</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x13</resetMask>
                    <fields>
                        <field>
                            <name>CLREOCAF</name>
                            <description>desc CLREOCAF</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CLREOCBF</name>
                            <description>desc CLREOCBF</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CLRSASTPDF</name>
                            <description>desc CLRSASTPDF</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DR0</name>
                    <description>desc DR0</description>
                    <addressOffset>0x50</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>DR1</name>
                    <description>desc DR1</description>
                    <addressOffset>0x52</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>DR2</name>
                    <description>desc DR2</description>
                    <addressOffset>0x54</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>DR3</name>
                    <description>desc DR3</description>
                    <addressOffset>0x56</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>DR4</name>
                    <description>desc DR4</description>
                    <addressOffset>0x58</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>DR5</name>
                    <description>desc DR5</description>
                    <addressOffset>0x60</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>DR6</name>
                    <description>desc DR6</description>
                    <addressOffset>0x62</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>DR7</name>
                    <description>desc DR7</description>
                    <addressOffset>0x64</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>DR8</name>
                    <description>desc DR8</description>
                    <addressOffset>0x66</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>DR9</name>
                    <description>desc DR9</description>
                    <addressOffset>0x68</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>DR10</name>
                    <description>desc DR10</description>
                    <addressOffset>0x70</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>DR11</name>
                    <description>desc DR11</description>
                    <addressOffset>0x72</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>DR12</name>
                    <description>desc DR12</description>
                    <addressOffset>0x74</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>DR13</name>
                    <description>desc DR13</description>
                    <addressOffset>0x76</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
                <register>
                    <name>DR14</name>
                    <description>desc DR14</description>
                    <addressOffset>0x78</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                </register>
