hdscmcu/pyOCD/pyocd/debug/svd/data/HC32F165.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>EFM</name>
            <description>desc EFM</description>
            <baseAddress>0x40010400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x289</size>
            </addressBlock>
            <registers>
                <register>
                    <name>FAPRT</name>
                    <description>desc FAPRT</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>FAPRT</name>
                            <description>desc FAPRT</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FSTP</name>
                    <description>desc FSTP</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>FSTP</name>
                            <description>desc FSTP</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FRMC</name>
                    <description>desc FRMC</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x90007</resetMask>
                    <fields>
                        <field>
                            <name>FLWT</name>
                            <description>desc FLWT</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CHE</name>
                            <description>desc CHE</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CRST0</name>
                            <description>desc CRST0</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FWMC</name>
                    <description>desc FWMC</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x171</resetMask>
                    <fields>
                        <field>
                            <name>PEMODE</name>
                            <description>desc PEMODE</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PEMOD</name>
                            <description>desc PEMOD</description>
                            <msb>6</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BUSHLDCTL</name>
                            <description>desc BUSHLDCTL</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FSR</name>
                    <description>desc FSR</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x100</resetValue>
                    <resetMask>0x13B</resetMask>
                    <fields>
                        <field>
                            <name>PEWERR</name>
                            <description>desc PEWERR</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PEPRTERR</name>
                            <description>desc PEPRTERR</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PGMISMTCH</name>
                            <description>desc PGMISMTCH</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>OPTEND</name>
                            <description>desc OPTEND</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>COLERR</name>
                            <description>desc COLERR</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RDY</name>
                            <description>desc RDY</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FSCLR</name>
                    <description>desc FSCLR</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3B</resetMask>
                    <fields>
                        <field>
                            <name>PEWERRCLR</name>
                            <description>desc PEWERRCLR</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PEPRTERRCLR</name>
                            <description>desc PEPRTERRCLR</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PGMISMTCHCLR</name>
                            <description>desc PGMISMTCHCLR</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OPTENDCLR</name>
                            <description>desc OPTENDCLR</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COLERRCLR</name>
                            <description>desc COLERRCLR</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FITE</name>
                    <description>desc FITE</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>PEERRITE</name>
                            <description>desc PEERRITE</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OPTENDITE</name>
                            <description>desc OPTENDITE</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COLERRITE</name>
                            <description>desc COLERRITE</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FPMTSW</name>
                    <description>desc FPMTSW</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3FFFF</resetMask>
                    <fields>
                        <field>
                            <name>FPMTSW</name>
                            <description>desc FPMTSW</description>
                            <msb>17</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FPMTEW</name>
                    <description>desc FPMTEW</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3FFFF</resetMask>
                    <fields>
                        <field>
                            <name>FPMTEW</name>
                            <description>desc FPMTEW</description>
                            <msb>17</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>UQID0</name>
                    <description>desc UQID0</description>
                    <addressOffset>0x50</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>UQID1</name>
                    <description>desc UQID1</description>
                    <addressOffset>0x54</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>UQID2</name>
                    <description>desc UQID2</description>
                    <addressOffset>0x58</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>UQID3</name>
                    <description>desc UQID3</description>
                    <addressOffset>0x5C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>HRCCFGR</name>
                    <description>desc HRCCFGR</description>
                    <addressOffset>0x288</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>HRCFREQS</name>
                            <description>desc HRCFREQS</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
