hdscmcu/pyOCD/pyocd/debug/svd/data/HC32F165.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>EMB0</name>
            <description>desc EMB</description>
            <baseAddress>0x40017C00</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x40</size>
            </addressBlock>
            <registers>
                <register>
                    <name>CTL1_0</name>
                    <description>desc CTL1_0</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1C700F3</resetMask>
                    <fields>
                        <field>
                            <name>CMPEN</name>
                            <description>desc CMPEN</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OSCSTPEN</name>
                            <description>desc OSCSTPEN</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PWMSEN0</name>
                            <description>desc PWMSEN0</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PWMSEN1</name>
                            <description>desc PWMSEN1</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PWMSEN2</name>
                            <description>desc PWMSEN2</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTINEN1</name>
                            <description>desc PORTINEN1</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTINEN2</name>
                            <description>desc PORTINEN2</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTINEN3</name>
                            <description>desc PORTINEN3</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INVSEL1</name>
                            <description>desc INVSEL1</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INVSEL2</name>
                            <description>desc INVSEL2</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INVSEL3</name>
                            <description>desc INVSEL3</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTL2_0</name>
                    <description>desc CTL2_0</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFF0007</resetMask>
                    <fields>
                        <field>
                            <name>PWMLV0</name>
                            <description>desc PWMLV0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PWMLV1</name>
                            <description>desc PWMLV1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PWMLV2</name>
                            <description>desc PWMLV2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NFSEL1</name>
                            <description>desc NFSEL1</description>
                            <msb>18</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NFEN1</name>
                            <description>desc NFEN1</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NFSEL2</name>
                            <description>desc NFSEL2</description>
                            <msb>22</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NFEN2</name>
                            <description>desc NFEN2</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NFSEL3</name>
                            <description>desc NFSEL3</description>
                            <msb>26</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NFEN3</name>
                            <description>desc NFEN3</description>
                            <msb>27</msb>
                            <lsb>27</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SOE0</name>
                    <description>desc SOE0</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>SOE</name>
                            <description>desc SOE</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STAT0</name>
                    <description>desc STAT0</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1C7EE</resetMask>
                    <fields>
                        <field>
                            <name>PWMSF</name>
                            <description>desc PWMSF</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CMPF</name>
                            <description>desc CMPF</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>OSF</name>
                            <description>desc OSF</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PWMST</name>
                            <description>desc PWMST</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CMPST</name>
                            <description>desc CMPST</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>OSST</name>
                            <description>desc OSST</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PORTINF1</name>
                            <description>desc PORTINF1</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PORTINF2</name>
                            <description>desc PORTINF2</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PORTINF3</name>
                            <description>desc PORTINF3</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PORTINST1</name>
                            <description>desc PORTINST1</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTINST2</name>
                            <description>desc PORTINST2</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTINST3</name>
                            <description>desc PORTINST3</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STATCLR0</name>
                    <description>desc STATCLR0</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x70E</resetMask>
                    <fields>
                        <field>
                            <name>PWMSFCLR</name>
                            <description>desc PWMSFCLR</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CMPFCLR</name>
                            <description>desc CMPFCLR</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>OSFCLR</name>
                            <description>desc OSFCLR</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PORTINFCLR1</name>
                            <description>desc PORTINFCLR1</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PORTINFCLR2</name>
                            <description>desc PORTINFCLR2</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>PORTINFCLR3</name>
                            <description>desc PORTINFCLR3</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTEN0</name>
                    <description>desc INTEN0</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x70E</resetMask>
                    <fields>
                        <field>
                            <name>PWMINTEN</name>
                            <description>desc PWMINTEN</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMPINTEN</name>
                            <description>desc CMPINTEN</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OSINTEN</name>
                            <description>desc OSINTEN</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTININTEN1</name>
                            <description>desc PORTININTEN1</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTININTEN2</name>
                            <description>desc PORTININTEN2</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTININTEN3</name>
                            <description>desc PORTININTEN3</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RLSSEL0</name>
                    <description>desc RLSSEL0</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x700</resetMask>
                    <fields>
                        <field>
                            <name>PORTINRSEL1</name>
                            <description>desc PORTINRSEL1</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTINRSEL2</name>
                            <description>desc PORTINRSEL2</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PORTINRSEL3</name>
                            <description>desc PORTINRSEL3</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECSR</name>
                    <description>desc ECSR</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3</resetMask>
                    <fields>
                        <field>
                            <name>EMBVAL</name>
                            <description>desc EMBVAL</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
