hdscmcu/pyOCD/pyocd/debug/svd/data/HC32F165.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="SPI1">
            <name>SPI2</name>
            <description>desc SPI</description>
            <baseAddress>0x4001C400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1C</size>
            </addressBlock>
        </peripheral>
        <peripheral>
            <name>SWDT</name>
            <description>desc SWDT</description>
            <baseAddress>0x40049400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0xC</size>
            </addressBlock>
            <registers>
                <register>
                    <name>CR</name>
                    <description>desc CR</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFF1FF2</resetValue>
                    <resetMask>0xFFFF1FF2</resetMask>
                    <fields>
                        <field>
                            <name>ITS</name>
                            <description>desc ITS</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CKS</name>
                            <description>desc CKS</description>
                            <msb>7</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WDPT</name>
                            <description>desc WDPT</description>
                            <msb>11</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SLPOFF</name>
                            <description>desc SLPOFF</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PERI</name>
                            <description>desc PERI</description>
                            <msb>31</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SR</name>
                    <description>desc SR</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x3FFFF</resetMask>
                    <fields>
                        <field>
                            <name>CNT</name>
                            <description>desc CNT</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>UDF</name>
                            <description>desc UDF</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>REF</name>
                            <description>desc REF</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RR</name>
                    <description>desc RR</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>RF</name>
                            <description>desc RF</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>TK</name>
            <description>desc TK</description>
            <baseAddress>0x4001BC00</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x98</size>
            </addressBlock>
            <registers>
                <register>
                    <name>CTRL</name>
                    <description>desc CTRL</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFF</resetValue>
                    <resetMask>0xD003FFFF</resetMask>
                    <fields>
                        <field>
                            <name>CHEN</name>
                            <description>desc CHEN</description>
                            <msb>17</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RST</name>
                            <description>desc RST</description>
                            <msb>28</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SWEN</name>
                            <description>desc SWEN</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AFEEN</name>
                            <description>desc AFEEN</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RESCAP</name>
                    <description>desc RESCAP</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x10040000</resetValue>
                    <resetMask>0x379F00CF</resetMask>
                    <fields>
                        <field>
                            <name>R1SEL</name>
                            <description>desc R1SEL</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>R2SEL</name>
                            <description>desc R2SEL</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>R4SEL</name>
                            <description>desc R4SEL</description>
                            <msb>7</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SAM</name>
                            <description>desc SAM</description>
                            <msb>17</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADCIBCT</name>
                            <description>desc ADCIBCT</description>
                            <msb>19</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SIGSEL</name>
                            <description>desc SIGSEL</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADCEN</name>
                            <description>desc ADCEN</description>
                            <msb>23</msb>
                            <lsb>23</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFS</name>
                            <description>desc CFS</description>
                            <msb>26</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AFEIBCT</name>
                            <description>desc AFEIBCT</description>
                            <msb>29</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SWTCNT1</name>
                    <description>desc SWTCNT1</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x64</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>HCNT</name>
                            <description>desc HCNT</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SWTCNT2</name>
                    <description>desc SWTCNT2</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x64</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>HCNT</name>
                            <description>desc HCNT</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SWTCNT3</name>
                    <description>desc SWTCNT3</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x64</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>HCNT</name>
                            <description>desc HCNT</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SWTCNT4</name>
                    <description>desc SWTCNT4</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x64</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>HCNT</name>
                            <description>desc HCNT</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SWTCNT5</name>
                    <description>desc SWTCNT5</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x64</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>HCNT</name>
                            <description>desc HCNT</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SWTCNT6</name>
                    <description>desc SWTCNT6</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x64</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>HCNT</name>
                            <description>desc HCNT</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFCAP</name>
                    <description>desc CFCAP</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x30012003</resetValue>
                    <resetMask>0xF1FFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>LCNT</name>
                            <description>desc LCNT</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CFRCNT</name>
                            <description>desc CFRCNT</description>
                            <msb>24</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SWTCF</name>
                            <description>desc SWTCF</description>
                            <msb>31</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MEASURE</name>
                    <description>desc MEASURE</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1900808</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>N</name>
                            <description>desc N</description>
                            <msb>7</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>M</name>
                            <description>desc M</description>
                            <msb>15</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADCCAL</name>
                            <description>desc ADCCAL</description>
                            <msb>17</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WITCNT</name>
                            <description>desc WITCNT</description>
                            <msb>31</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SCAN</name>
                    <description>desc SCAN</description>
                    <addressOffset>0x28</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x300C0</resetValue>
                    <resetMask>0x300DF</resetMask>
                    <fields>
                        <field>
                            <name>SCCH</name>
                            <description>desc SCCH</description>
                            <msb>4</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ALLCH</name>
                            <description>desc ALLCH</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LOOP</name>
                            <description>desc LOOP</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MODSEL</name>
                            <description>desc MODSEL</description>
                            <msb>17</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>START</name>
                    <description>desc START</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>START</name>
                            <description>desc START</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTCTL</name>
                    <description>desc INTCTL</description>
                    <addressOffset>0x30</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1F1F</resetMask>
                    <fields>
                        <field>
                            <name>HFEN</name>
                            <description>desc HFEN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AFEN</name>
                            <description>desc AFEN</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OFEN</name>
                            <description>desc OFEN</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ERREN</name>
                            <description>desc ERREN</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DONEEN</name>
                            <description>desc DONEEN</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STAT</name>
                            <description>desc STAT</description>
                            <msb>12</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FIFOTHR</name>
                    <description>desc FIFOTHR</description>
                    <addressOffset>0x34</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x300</resetValue>
                    <resetMask>0x83FF</resetMask>
                    <fields>
                        <field>
                            <name>THRESH</name>
                            <description>desc THRESH</description>
                            <msb>9</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DMASEL</name>
                            <description>desc DMASEL</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
