hdscmcu/pyOCD/pyocd/debug/svd/data/HC32F165.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="USART1">
            <name>USART2</name>
            <description>desc USART</description>
            <baseAddress>0x4001D400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1C</size>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="USART1">
            <name>USART3</name>
            <description>desc USART</description>
            <baseAddress>0x40021000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1C</size>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="USART1">
            <name>USART4</name>
            <description>desc USART</description>
            <baseAddress>0x40021400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1C</size>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="USART1">
            <name>USART5</name>
            <description>desc USART</description>
            <baseAddress>0x40021800</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1C</size>
            </addressBlock>
        </peripheral>
        <peripheral derivedFrom="USART1">
            <name>USART6</name>
            <description>desc USART</description>
            <baseAddress>0x40021C00</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1C</size>
            </addressBlock>
        </peripheral>
    </peripherals>
</device>
